# EnableRevealHiddenMode Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..EnableRevealHiddenMode Method
View Class See Also
---
Enables Reveal Hidden elements mode.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void EnableRevealHiddenMode()
```

Visual Basic
---
```text
Public Sub EnableRevealHiddenMode
```

Visual C++
---
```text
public:
void EnableRevealHiddenMode()
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | View cannot use temporary visibility modes. |

# See Also
View Class
Autodesk.Revit.DB Namespace